import React from "react";
import rightArrowIcons from "../img/icons/free-icon-font-angle-right.png";

function TermsOfUseUiPanel({
  activeTermsOfUseUiPanel,
  setActiveTermsOfUseUiPanel,
}) {
  return (
    <div
      className={
        activeTermsOfUseUiPanel
          ? "vrap_terms_of_use_UiPanel active"
          : "vrap_terms_of_use_UiPanel"
      }>
      <div
        className={
          activeTermsOfUseUiPanel
            ? "vrap_header_terms_of_use_UiPanel active"
            : "vrap_header_terms_of_use_UiPanel"
        }>
        <div className="header_terms_of_use_UiPanel">
          <div
            className="icon_header_terms_of_use_UiPanel"
            onClick={() => setActiveTermsOfUseUiPanel(false)}>
            <img
              src={rightArrowIcons}
              alt="aaaaaa"></img>
          </div>
          Условия использования
        </div>
      </div>
      <div
        className={
          activeTermsOfUseUiPanel
            ? "terms_of_use_UiPanel active"
            : "terms_of_use_UiPanel "
        }>
        КОРИСТУВАЦЬКА УГОДА Цей документ «Користувацька угода» являє собою
        пропозицію '******************', 'ТОВ Бара***' укласти договір на
        викладених нижче умовах 1. Предмет угоди користувача 2. Реєстрація на
        Сайті 3. Умови оформлення Замовлення та продажу Товарів 4. Доставка
        Замовлення 5. Ціна Товару та умови оплати Замовлення 6. Повернення
        Товару та грошових коштів 7. Обмеження відповідальності Продавця 8.
        Обмеження на використання сайту Користувачем 9. Права та обов’язки
        користувача 10. Права та обов’язки Продавця 11. Відповідальність
        користувача Продавця 12. Кінцеві положення
        toysamiybarashek2.choiceqr.com - це сайт, розташований за адресою ,
        створений та діючий з метою реалізації (продажу) покупцям (фізичним та
        юридичним особам) товарів, наданих на сайті, що перебувають у власності
        '***************', 'ТОВ Бара***' до моменту їх реалізації покупцям.
        '***************', 'ТОВ Бара***' є юридичною особою, зареєстрованою
        відповідно до чинного законодавства України, що здійснює продаж товарів
        дистанційним способом (за допомогою Інтернет-магазину на сайті
        toysamiybarashek2.choiceqr.com). Замовлення товарів дистанційним
        способом за допомогою Інтернет-магазину toysamiybarashek2.choiceqr.com
        дозволяє користувачем зазначеного Сайту (реальним та/або потенційним
        покупцям) знайти опис необхідного товару (включаючи його технічні
        характеристики, вартість, діючі акції, адресу, умови реалізації, а також
        іншу інформацію, що є обов'язковою при дистанційній формі реалізації
        товарів) та гарантовано придбати у продавця ***************, ТОВ Бара***
        обраний товар. Ця угода регулює відносини, що виникають між ФОП
        Афлятунова Ельвіра Ільдарівна, ТОВ Бара*** в мережі Інтернет,
        розташованого за адресою toysamiybarashek2.choiceqr.com, будь-яким
        користувачем зазначеного сайту - фізичною або юридичною особою, яка
        виступає як відвідувач сайту або покупець у Продавця товарів, розміщених
        на сайті. Основні поняття, що використовуються в Угоді користувача: Сайт
        - Інтернет-сайт, що належить Продавцю, розташований в мережі Інтернет за
        адресою toysamiybarashek2.choiceqr.com (далі - сайт), де представлені
        Товари, пропоновані Продавцем для придбання, а також умови оплати та
        доставки Товарів Покупцям. Сайт є Інтернет-магазином Продавця. Продавець
        - ФОП **********************************************, 431563**,
        ****************, , що здійснює продаж Товарів, представлених на Сайті,
        за допомогою дистанційної торгівлі. Сервіс - комплекс послуг, що
        надаються користувачеві з використання Сайту в інформаційних цілях, для
        отримання Контенту, а також з метою ознайомлення з Товарами. Товар -
        хлібобулочні вироби, плоди та овочі, кондитерські, винно-горілчані,
        безалкогольні напої, молочно-олійні, м'ясні та ковбасні вироби, рибні,
        яєчні, харчові жири, тютюнові вироби. Контент - текстові, графічні
        зображення, аудіо- та відеоматеріали, інформація та повідомлення
        будь-якого характеру, розміщена ***************, ТОВ Бара*** на Сайті.
        Користувач - дієздатна фізична особа, яка приймає умови цієї Угоди та
        пройшла процедуру реєстрації на Сайті у власному інтересі або виступає
        від імені та в інтересах представленної ним юридичної особи. Покупець -
        Користувач, який розмістив Замовлення на Сайті на придбання Товару,
        зазначеного на Сайті та присутнього у Продавця в наявності. Реєстрація
        Користувача на Сайті - процес створення Користувачем власного Облікового
        запису шляхом заповнення на Сайті спеціальних форм. Реєстрація на Сайті
        надає можливість зареєстрованому користувачеві отримувати Сервіс Сайту,
        розміщувати Замовлення на придбання Товарів у Продавця електронним
        способом за допомогою Сайту. Обліковий запис Користувача - це сукупність
        інформації про користувача відповідно до запропонованих Продавцем до
        заповнення полів на Сайті, яка дозволяє однозначно ідентифікувати
        користувача в процесі використання ним Сайту. Обліковий запис самостійно
        створюється Користувачем шляхом надання відомостей про себе. Для
        отримання доступу до свого облікового запису Користувач використовує
        повідомлені йому при реєстрації адресу електронної пошти (e-mail)
        пароль. Замовлення - належним чином оформлений запит Покупця на
        придбання Товарів, обраних на Сайті та наявних у наявності у Продавця, а
        також на їх доставку за вказаною Покупцем адресою на умовах, зазначених
        на Сайті у розділі «Оплата доставка». 1. Предмет угоди користувача 1.1
        Предметом цієї угоди є надання можливості користувачеві отримувати
        Сервіси Сайту, отримувати Контент Сайта, а також купувати для особистих,
        сімейних, домашніх та інших потреб, а також для потреб, пов'язаних зі
        здійсненням підприємницької діяльності, Товари, представлені в каталозі
        Сайту за адресою , а також будь-який розвиток та/або додавання нових
        сервісів, Товарів та послуг. 1.2 Ця угода поширюється на всі Сервіси,
        Товари, послуги, представлені на Сайті. 1.3. Обов'язковою умовою
        використання Сайту його Сервісів є повне беззастережне прийняття
        користувачем умов таких документів: Даної угоди користувача Політики
        конфіденційності, розміщеної в мережі Інтернет за адресою Замовлення
        Товару у Продавця будь-яким способом (за допомогою сервісів Сайта,
        телефоном або особисто) означає згоду Користувача/Покупця з усіма
        умовами цієї угоди Користувача. 1.4 У разі незгоди з цією угодою
        користувача (далі - Угода) Користувач зобов'язаний припинити
        використання Сайту його Сервісів покинути Сайт. 1.5 Продавець за
        допомогою Сервісів Сайту надає користувачам: інформаційні послуги за
        допомогою публікації товарів, що реалізуються власне Продавцем через
        Інтернет-ресурс , а саме: фотографій товарів, їх вартості, наявність або
        відсутність на складі Продавця, діючих акціях на товар або групу
        товарів, умовах замовлення товарів та їх доставки, контактної та іншої
        необхідності інформації про товари та про Продавця; послуги з придбання
        товарів, інформація про які представлена на сайті та наявних, а саме:
        можливість зробити замовлення обраного товару безпосередньо на сайті, а
        також за вказаним телефоном усно диспетчеру Продавця; отримати
        замовлений товар (товари) в узгоджені з Продавцем терміни за вказаною
        Покупцем адресою з комплектом супровідних документів, передбачених
        чинним законодавством України. 1.6 Користувач прямо погоджується з тим,
        що використовує Сайт будь-яку розміщену на сайті інформацію на свій
        власний ризик. 1.7 Умови цієї Угоди користувача приймаються Користувачем
        під час реєстрації в порядку, передбаченому Сайтом цією Угодою
        користувача, а також у разі замовлення Товару у Продавця будь-яким
        можливим способом. 1.8 Угода користувача діє весь час використання
        Користувачем Сервісів Сайту та/або весь час замовлення Покупцем Товарів
        у Продавця. 1.9 Угода користувача може бути змінена Продавцем у
        будь-який момент без будь-якого попереднього повідомлення користувача.
        Нова версія Угоди користувача набирає чинності з моменту її розміщення
        на Сайті, якщо інше не передбачено новою редакцією Угоди користувача.
        1.10 Найбільш актуальна версія Угоди користувача завжди знаходиться на
        сторінці за адресою: Увага: якщо Ви не згодні з будь-яким положенням
        цієї угоди Користувача, не оформлюйте замовлення на сайті 2. Реєстрація
        на Сайті 2.1 Реєстрація на Сайті є обов'язковою для оформлення
        Замовлення. При оформленні замовлення за телефоном користувач також
        проходить Реєстрацію на Сайті за допомогою співробітника Продавця. При
        цьому користувачеві також створюється Обліковий запис на Сайті.
        Створення Облікового запису Користувача зі слів Користувача також є
        прийняттям цієї Угоди користувача в повному обсязі без будь-яких
        виключень обмежень. 2.2 Під час реєстрації користувач зобов'язується
        надавати про себе тільки достовірну, точну повну інформацію про себе з
        питань, пропонованих у реєстраційній формі та підтримувати цю інформацію
        в актуальному стані. Якщо користувач надає невірну інформацію або
        Продавець має підстави вважати, що надана користувачем інформація
        неповна або недостовірна, Продавець має право на власний розсуд
        заблокувати або видалити обліковий запис Користувача, а також відмовити
        користувачеві у використанні Сайтів його Сервісів повністю або частково.
        2.3 Під час реєстрації на Сайті Користувач надає наступну інформацію:
        прізвище, ім'я, адресу електронної пошти, контактний телефон. 2.4
        Інформація про користувача, що міститься в обліковому записі
        Користувача, зберігається та обробляється Продавцем відповідно до
        Політики конфіденційності. Політика конфіденційності є невід'ємною
        частиною угоди користувача наведена на сайті 2.5 Користувач
        зобов’язується негайно повідомити Продавця про будь-який випадок
        несанкціонованого використання його Облікового запису, а також про
        відомі йому випадки компрометації (втрати конфіденційності) пароля, що
        використовується Користувачем для отримання доступу до свого Облікового
        запису. До моменту, коли Продавець отримає від Користувача повідомлення
        про несанкціоноване використання його Облікового запису, або про
        компрометацію пароля, відповідальність за всі дії, які провадяться з
        використанням відповідного Облікового запису, несе Користувач. 2.6
        Користувач зобов'язується не передавати іншим особами свої персональні
        дані, отримані під час реєстрації (логін пароль) для входу/ідентифікації
        на Сайт, несе повну відповідальність за втрату, зникнення або передачу
        іншими способами персональних даних, а також за наслідки, пов'язані з
        цим діянням. Продавець не несе відповідальності за дії третіх осіб, які
        скористалися персональними даними користувача. 3. Умови оформлення
        Замовлення та продажу Товарів 3.1 Замовляючи Товари будь-яким способом,
        Користувач погоджується з умовами оформлення Замовлення та продажу
        Товарів, встановленими Продавцем. 3.2 Умови продажу Товарів, а також
        інформація про Товари, представлені на Сайті, є публічною офертою. 3.3
        Користувач погоджується з умовами оформлення Замовлення та продажу
        Товарів шляхом проставлення відмітки у графі «З даними умовами згоден»
        при реєстрації на Сайті та оформленні Замовлення. УВАГА: Покупець несе
        повну відповідальність за надання невірних відомостей при оформленні
        Замовлення, що спричинило за собою неможливість належного виконання
        Продавцем своїх зобов'язань перед Покупцем. 3.4 У більшості випадків
        кожна одиниця Товару, представлена на Сайті, супроводжується
        фотографією. Супроводжуючі Товар фотографії є простими ілюстраціями до
        Товару можуть відрізнятися від фактичного зовнішнього вигляду Товару.
        3.5 Деякі (або всі) одиниці Товару можуть супроводжуватися описами
        та/або характеристиками Товару, які при цьому не претендують на вичерпну
        інформативність можуть містити піклування. Для уточнення інформації щодо
        Товару Покупець повинен звернутися до адміністратора за телефоном
        380988161358, +380989718616. 3.6 У переважній більшості випадків кожна
        одиниця Товару, представлена на Сайті, є в наявності у Продавця. У разі
        замовлення Покупцем Товару, відсутнього на складі Продавця на момент
        виконання Замовлення, Продавець має право виключити зазначений Товар із
        Замовлення та/або анулювати Замовлення Покупця, повідомивши про це
        Покупця шляхом надсилання відповідного електронного повідомлення на
        адресу, вказану Покупцем при реєстрації, або дзвінком Продавця. 3.7 У
        разі анулювання повністю або частково передплаченого Замовлення,
        вартість анульованого Товару повертається Продавцем Покупцю у формі, яка
        узгоджується додатково за телефоном або e-mail. 3.8 Продавець вживає
        всіх можливих законних заходів для забезпечення на своєму складі всіх
        Товарів, поданих на Сайті. 4. Доставка Замовлення 4.1 Способи та
        розцінки на доставку Товарів вказані на Сайті на сторінці оформлення
        замовлення на доставку 4.2 Доставка є окремою послугою Продавця.
        Доставка не є невід'ємною частиною придбаного Покупцем Товару. 4.3
        Територія доставки Товарів, представлених на Сайті, обмежена межами
        України. 5. Ціна Товару та умови оплати Замовлення 5.1 Всі розрахунки
        між Сторонами здійснюються в гривні. 5.2 Ціна Товару зазначається на
        Сайті. 5.3 Ціна Товару, поданого на Сайті, може бути змінена Продавцем в
        односторонньому порядку. При цьому ціна на замовлений Покупцем Товар
        зміні не підлягає. 5.4 На окремі (або всі) найменування Товару Продавцем
        може бути встановлена знижка (акція, що діє на момент Замовлення
        Покупцем даних найменувань Товарів). Ціна Товару зі знижкою вказується
        на сайті. 5.5 Покупець оплачує Замовлення, обравши на власний розсуд та
        можливості один із способів оплати, зазначених на Сайті 6. Повернення
        Товару та грошових коштів 6.1 Повернення товару здійснюється відповідно
        до Закону України «Про захист прав споживачів». У період 14 днів, не
        враховуючи дня покупки, можна оформити повернення товару за умов: товар
        не був у експлуатації цілісність комплекту та упаковки не порушена
        збережений документ, який підтверджує оплату виріб не належить до
        переліку товарів неналежної якості, повернення яких обмежено рішенням
        Кабінету Міністрів України (постанова від 19 березня 1994 року №172) 6.2
        Повернення грошових коштів здійснюється за допомогою повернення вартості
        сплаченого Товару на банківську картку, поштовим переказом або готівкою
        в офісі компанії за адресою, вказаною на Сайті в розділі «Контакти».
        Спосіб повернення коштів обумовлюється Покупцем з Продавцем по телефону
        або e-mail. 7. Обмеження відповідальності Продавця 7.1 Продавець несе
        відповідальність перед користувачами за зміст та безпеку інформації,
        розміщеної на сайті, за достовірність та актуальність інформації про
        товари, наявність, ціни, умови доставки та інші супутні послуги,
        представлені на Сайті. При цьому Продавець має право на власний розсуд
        вносити зміни до описів товарів послуг з метою найкращого просування
        товарів на ринку. 7.2 Продавець не несе відповідальності: за наслідки
        застосування, використання або невикористання отриманої на сайті
        інформації. за можливу невідповідність результатів, отриманих при
        використанні сайту, очікуванням користувача. за будь-які пошкодження
        обладнання або програмного забезпечення користувача, що виникли в
        результаті використання сайту. за відсутність можливості використання
        сайту з будь-яких причин. 7.3 Продавець не несе перед Користувачем, або
        третіми особами відповідальності за шкоду, збитки або витрати, що
        виникли у зв'язку з використанням або невикористанням сайту, включаючи
        упущену вигоду або недоотриманий прибуток. 7.4 Користувач погоджується,
        що будь-яка інформація та зображення, розміщені на сайті, можуть бути
        використані Продавцем на власний розсуд без виплати Користувачеві
        будь-якої винагороди. 7.5 Продавець не несе жодних зобов'язань щодо
        забезпечення конфіденційності щодо інформації, що надається його
        користувачам. Продавець не несе відповідальності за неспівпадіння
        очікуваних Користувачем реально отриманих послуг/придбаних товарів. 8.
        Обмеження на використання сайту Користувачем 8.1 Під час використання
        сайту Користувач не має права ( погоджується з цим): копіювати
        використовувати в комерційних цілях будь-яку інформацію, одержану за
        допомогою даного сайту, що порушує права інших користувачів або може
        завдати їм прямої матеріальної або моральної шкоди надсилати на адреси
        електронної пошти, вказані на Ресурсі, несанкціоновані поштові
        повідомлення рекламного типу (junk mail, spam) видавати себе за іншу
        людину або за представника Продавця без достатніх на те прав, в тому
        числі за співробітників Продавця за власника сайту. 8.2 Користувач
        погоджується не відтворювати, не повторювати не копіювати, не продавати
        не перепродувати, а також не використовувати для будь-яких комерційних
        цілей будь-які частини сайту, використання служб або доступ до них, крім
        тих випадків, коли такий дозвіл надано користувачеві Продавцем. 8.3
        Користувач має право розірвати відносини з Продавцем відмовитися від
        використання його сайту сервісів, повідомивши про це на e-mail
        barasekharkovbuh@gmail.com, anastasialazartseva7654@gmail.com. При цьому
        дані користувача буде вилучено, доступ до сервісів буде заблоковано. 9.
        Права та обов'язки користувача 9.1 Цим користувач проінформований та
        погоджується з тим, що відповідальність за доставку товару у разі згоди
        Користувача з доставкою та вказівкою Користувачем достовірної адреси
        доставки Товару, а також у разі забезпечення Користувачем приймання
        Товару та його оплати, несе Продавець. Всі конфліктні ситуації
        суперечки, пов'язані з доставкою товару, повинні вирішуватися
        користувачем-покупцем з Продавцем. 9.2 Користувач (у тому числі є
        покупцем) зобов'язаний передавати Продавцю інформацію про всі випадки
        виникнення конфліктних ситуацій, пов'язаних з продажем Товару або
        доставкою Товару. 9.3 Будь-який користувач має право залишати відгуки
        про Товари, які розміщені на сайті. 9.4 Користувач зобов'язується не
        вживати дій, спрямованих на заподіяння шкоди програмній або апаратній
        частині сайту (поширення вірусних програм, злом серверів тощо), а також
        повідомляти Продавця про будь-які відомі йому ситуації, які несуть
        потенційну загрозу для безпечного функціонування Сайту. Користувач
        зобов'язується чітко виконувати умови цієї угоди будь-яких доповнень до
        неї. 10. Права та обов'язки Продавця. 10.1 Продавець гарантує збереження
        конфіденційності щодо даних про користувача. 10.2 Продавець залишає за
        собою право припинити доступ до особистого кабінету та заблокувати
        та/або анулювати реєстрацію без попереднього повідомлення Користувача,
        не несе жодної відповідальності за припинення доступу до своїх сервісів.
        При цьому інформація користувача знищується, а реєстрація користувача
        анулюється. 10.3 У разі порушення Користувачем умов цієї угоди Продавець
        має право призупинити співпрацю та/або користування сайтом даному
        користувачеві до моменту усунення Користувачем допущених порушень та
        відшкодування (компенсації) заподіяних Продавцю таким порушенням збитків
        у повному обсязі. 10.4 Продавець самостійно визначає термін публікації
        відгуків користувача. 10.5 Продавець не повідомляє користувачів про
        видалення або відмову публікації відгуків. Продавець має право не
        публікувати відкликання Користувача через невідповідність реальному
        досвіду використання послуг Продавця товарів Продавця, або у разі якщо
        інформація не є корисною для інших Користувачів сайту. 10.6 Продавець
        має право тимчасово призупинити роботу сайту з технічних, технологічних
        чи інших причин - на час усунення таких причин з попереднім
        повідомленням Покупців або без такого повідомлення. 10.7 Продавець має
        право переуступати або яким-небудь іншим способом передавати свої права
        та обов'язки, що випливають з його відносин з Покупцем, третім особам.
        11. Відповідальність користувача Продавця 11.1 Продавець не несе
        відповідальності за шкоду, заподіяну Покупцю внаслідок неналежного
        використання Товарів, придбаних у Покупця за допомогою сервісів Сайту.
        11.2 Продавець не несе відповідальності за відомості, надані
        користувачем на Сайті у загальнодоступній формі. 11.3 Користувач
        погоджується з тим, що всі можливі суперечки з приводу цієї угоди
        вирішуватися за нормами Українського законодавства. Користувач
        погоджується з тим, що всі можливі суперечки з приводу його діяльності
        на сайті також будуть вирішуватися за нормами Українського
        законодавства. 11.4 Продавець не встановлює з користувачем агентських
        відносин, відносин товариства, відносин щодо спільної діяльності,
        відносин особистого найму, а також якихось інших відносин. 11.5
        Бездіяльність з боку Продавця у разі порушення користувачем або групою
        користувачів цієї угоди користувача не означає того, що Продавець сприяє
        користувачеві або групі користувачів у таких діях. 11.6 Сторони
        звільняються від відповідальності за порушення умов цієї угоди
        Користувача, якщо таке порушення викликане дією обставин непереборної
        сили (форс-мажор), включаючи: дії органів державної влади (в т. ч.
        прийняття правових актів), пожежа, повінь, землетрус, інші стихійні
        лиха, відсутність електроенергії та/або збої роботи комп'ютерної мережі,
        страйки, громадянські хвилювання, заворушення, будь-які інші обставини,
        не обмежуючись перерахованим, які можуть вплинути на виконання Сторонами
        своїх зобов'язань. 12. Прикінцеві положення 12.1 До відносин між
        Користувачем (Покупцем) Продавцем застосовуються положення чинного
        законодавства України. 12.2 У разі виникнення питань претензій з боку
        Користувача (Покупця) він повинен звернутися до Продавця за телефоном
        або іншим доступним способом. Всі виникаючі суперечки сторони будуть
        намагатися вирішити шляхом переговорів, при недосягненні угоди спір буде
        переданий на розгляд до судового органу відповідно до чинного
        законодавства України. 12.3 Визнання судом недійсності будь-якого
        положення цієї Угоди не тягне за собою недійсність інших положень. ЗГОДА
        КОРИСТУВАЧА З ЦІЄЮ КОРИСТУВАЦЬКОЮ УГОДОЮ Якщо користувач НЕ згоден з
        усіма вищевказаними умовами, він НЕ буде зареєстрований на Сайті
        Продавця за адресою , не має права оформлювати замовлення та НЕ матиме
        можливості користуватися всіма сервісами зазначеного Сайту.
      </div>
    </div>
  );
}

export default TermsOfUseUiPanel;
